return {
  "folke/snacks.nvim",
  opts = {
    indent = {
      enabled = true,

      config = function(_, opts)
        require("snacks").setup(opts)

        vim.api.nvim_set_hl(0, "SnacksIndentScope", {
          fg = "#00C4FF", -- change THIS (active pink line)
          bold = true,
        })
      end,
    },
    explorer = {
      trash = true,
      diagonostics = false,
    },
    terminal = {
      win = {
        position = "float",
        border = "rounded",
        width = 0.9,
        height = 0.85,
      },
    },
    dashboard = {
      preset = {
        keys = {},
        header_align = "center",
        header = [[
 ██╗  ██╗ ██╗ ███╗   ███╗  █████╗  ███╗   ██╗     ███╗   ██╗ ██╗   ██╗ ██╗ ███╗   ███╗
 ██║  ██║ ██║ ████╗ ████║ ██╔══██╗ ████╗  ██║     ████╗  ██║ ██║   ██║ ██║ ████╗ ████║
 ███████║ ██║ ██╔████╔██║ ███████║ ██╔██╗ ██║     ██╔██╗ ██║ ██║   ██║ ██║ ██╔████╔██║
 ██╔══██║ ██║ ██║╚██╔╝██║ ██╔══██║ ██║╚██╗██║     ██║╚██╗██║ ╚██╗ ██╔╝ ██║ ██║╚██╔╝██║
 ██║  ██║ ██║ ██║ ╚═╝ ██║ ██║  ██║ ██║ ╚████║ ██╗ ██║ ╚████║  ╚████╔╝  ██║ ██║ ╚═╝ ██║
 ╚═╝  ╚═╝ ╚═╝ ╚═╝     ╚═╝ ╚═╝  ╚═╝ ╚═╝  ╚═══╝ ╚═╝ ╚═╝  ╚═══╝   ╚═══╝   ╚═╝ ╚═╝     ╚═╝
        ]],
      },
    },
  },
}
